[Killed] BlockStatement
src/helper/disableComponent.js:4:63
 import {isEmpty, isNil} from 'lodash';
 import {CANCEL_BUTTON_TITLE, CLEAR_BUTTON_LABEL,} from '../constants/translationLabels/formElements';
 
-export const setDisableButton = (pristine, submitting, id) => {
-    if (!pristine || !isNil(id)) {
-        return false;
-    }
-    return true;
-};
+export const setDisableButton = (pristine, submitting, id) => {};
 export const getClearOrCancelTitle = (id, t) => {
     return id === undefined ? t(CLEAR_BUTTON_LABEL) : t(CANCEL_BUTTON_TITLE);
killedBy: setDisableButton function should return true if pristine and submitting equal true, and id is undefined or null
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] LogicalOperator
src/helper/disableComponent.js:5:9
 import {CANCEL_BUTTON_TITLE, CLEAR_BUTTON_LABEL,} from '../constants/translationLabels/formElements';
 
 export const setDisableButton = (pristine, submitting, id) => {
-    if (!pristine || !isNil(id)) {
+    if (!pristine && !isNil(id)) {
         return false;
     }
killedBy: setDisableButton function should return false if pristine equal false
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
src/helper/disableComponent.js:5:9
 import {CANCEL_BUTTON_TITLE, CLEAR_BUTTON_LABEL,} from '../constants/translationLabels/formElements';
 
 export const setDisableButton = (pristine, submitting, id) => {
-    if (!pristine || !isNil(id)) {
+    if (true) {
         return false;
     }
killedBy: setDisableButton function should return true if pristine and submitting equal true, and id is undefined or null
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/helper/disableComponent.js:6:16
 
 export const setDisableButton = (pristine, submitting, id) => {
     if (!pristine || !isNil(id)) {
-        return false;
+        return true;
     }
     return true;
killedBy: setDisableButton function should return false if pristine equal false
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/helper/disableComponent.js:10:49
     }
     return true;
 };
-export const getClearOrCancelTitle = (id, t) => {
-    return id === undefined ? t(CLEAR_BUTTON_LABEL) : t(CANCEL_BUTTON_TITLE);
-};
+export const getClearOrCancelTitle = (id, t) => {};
 
 export const setDisabledSaveButtonSemester = (pristine, submitting, semester, selectedGroups = []) => {
killedBy: getClearOrCancelTitle function should return clear_button_label if id equal undefined
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "clear_button_label"
Received: undefined

[Killed] EqualityOperator
src/helper/disableComponent.js:11:12
     return true;
 };
 export const getClearOrCancelTitle = (id, t) => {
-    return id === undefined ? t(CLEAR_BUTTON_LABEL) : t(CANCEL_BUTTON_TITLE);
+    return id !== undefined ? t(CLEAR_BUTTON_LABEL) : t(CANCEL_BUTTON_TITLE);
 };
 
killedBy: getClearOrCancelTitle function should return clear_button_label if id equal undefined
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "clear_button_label"
Received: "cancel_button_title"

[Killed] ConditionalExpression
src/helper/disableComponent.js:11:12
     return true;
 };
 export const getClearOrCancelTitle = (id, t) => {
-    return id === undefined ? t(CLEAR_BUTTON_LABEL) : t(CANCEL_BUTTON_TITLE);
+    return true ? t(CLEAR_BUTTON_LABEL) : t(CANCEL_BUTTON_TITLE);
 };
 
killedBy: getClearOrCancelTitle function should return cancel_button_title if id equal 49
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cancel_button_title"
Received: "clear_button_label"

[Killed] BlockStatement
src/helper/disableComponent.js:14:103
     return id === undefined ? t(CLEAR_BUTTON_LABEL) : t(CANCEL_BUTTON_TITLE);
 };
 
-export const setDisabledSaveButtonSemester = (pristine, submitting, semester, selectedGroups = []) => {
-    if (!isEmpty(semester) && semester.id) {
-        const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
-        const restGroups = (selectedGroups ?? []).map((item) => item.id);
-        const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
-        const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
-        const isChosenGroup =
-            isEmpty(semester.semester_groups) || !isEmpty(newGroups) || !isEmpty(deleteGroups);
-        return !isChosenGroup && (pristine || submitting);
-    }
-    return pristine || submitting;
-};
+export const setDisabledSaveButtonSemester = (pristine, submitting, semester, selectedGroups = []) => {};
 
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester is empty
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BooleanLiteral
src/helper/disableComponent.js:15:9
 };
 
 export const setDisabledSaveButtonSemester = (pristine, submitting, semester, selectedGroups = []) => {
-    if (!isEmpty(semester) && semester.id) {
+    if (isEmpty(semester) && semester.id) {
         const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
         const restGroups = (selectedGroups ?? []).map((item) => item.id);
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester is null
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/helper/disableComponent.js:15:9
 };
 
 export const setDisabledSaveButtonSemester = (pristine, submitting, semester, selectedGroups = []) => {
-    if (!isEmpty(semester) && semester.id) {
+    if (false) {
         const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
         const restGroups = (selectedGroups ?? []).map((item) => item.id);
killedBy: setDisabledSaveButtonSemester function Edge cases for setDisabledSaveButtonSemester kills isEmpty semester_groups removal mutant
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] OptionalChaining
src/helper/disableComponent.js:16:29
 
 export const setDisabledSaveButtonSemester = (pristine, submitting, semester, selectedGroups = []) => {
     if (!isEmpty(semester) && semester.id) {
-        const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
+        const beginGroups = semester.semester_groups.map((item) => item.id) ?? [];
         const restGroups = (selectedGroups ?? []).map((item) => item.id);
         const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
killedBy: setDisabledSaveButtonSemester function Edge cases for setDisabledSaveButtonSemester should handle semester without semester_groups property
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
src/helper/disableComponent.js:16:29
 
 export const setDisabledSaveButtonSemester = (pristine, submitting, semester, selectedGroups = []) => {
     if (!isEmpty(semester) && semester.id) {
-        const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
+        const beginGroups = semester.semester_groups?.map(item => item.id) && [];
         const restGroups = (selectedGroups ?? []).map((item) => item.id);
         const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester has groups and selectedGroups matches
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArrowFunction
src/helper/disableComponent.js:17:55
 export const setDisabledSaveButtonSemester = (pristine, submitting, semester, selectedGroups = []) => {
     if (!isEmpty(semester) && semester.id) {
         const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
-        const restGroups = (selectedGroups ?? []).map((item) => item.id);
+        const restGroups = (selectedGroups ?? []).map(() => undefined);
         const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
         const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester has groups and selectedGroups matches
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] LogicalOperator
src/helper/disableComponent.js:17:29
 export const setDisabledSaveButtonSemester = (pristine, submitting, semester, selectedGroups = []) => {
     if (!isEmpty(semester) && semester.id) {
         const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
-        const restGroups = (selectedGroups ?? []).map((item) => item.id);
+        const restGroups = (selectedGroups && []).map((item) => item.id);
         const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
         const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester has groups and selectedGroups matches
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/helper/disableComponent.js:18:56
     if (!isEmpty(semester) && semester.id) {
         const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
         const restGroups = (selectedGroups ?? []).map((item) => item.id);
-        const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
+        const newGroups = restGroups.filter((group) => beginGroups.includes(group));
         const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
         const isChosenGroup =
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester has groups and selectedGroups matches
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArrowFunction
src/helper/disableComponent.js:18:45
     if (!isEmpty(semester) && semester.id) {
         const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
         const restGroups = (selectedGroups ?? []).map((item) => item.id);
-        const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
+        const newGroups = restGroups.filter(() => undefined);
         const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
         const isChosenGroup =
killedBy: setDisabledSaveButtonSemester function Edge cases for setDisabledSaveButtonSemester kills newGroups check mutant
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BooleanLiteral
src/helper/disableComponent.js:19:60
         const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
         const restGroups = (selectedGroups ?? []).map((item) => item.id);
         const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
-        const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
+        const deleteGroups = beginGroups.filter((group) => restGroups.includes(group));
         const isChosenGroup =
             isEmpty(semester.semester_groups) || !isEmpty(newGroups) || !isEmpty(deleteGroups);
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester has groups and selectedGroups matches
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] MethodExpression
src/helper/disableComponent.js:19:30
         const beginGroups = semester.semester_groups?.map((item) => item.id) ?? [];
         const restGroups = (selectedGroups ?? []).map((item) => item.id);
         const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
-        const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
+        const deleteGroups = beginGroups;
         const isChosenGroup =
             isEmpty(semester.semester_groups) || !isEmpty(newGroups) || !isEmpty(deleteGroups);
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester has groups and selectedGroups matches
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] LogicalOperator
src/helper/disableComponent.js:21:13
         const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
         const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
         const isChosenGroup =
-            isEmpty(semester.semester_groups) || !isEmpty(newGroups) || !isEmpty(deleteGroups);
+            isEmpty(semester.semester_groups) && !isEmpty(newGroups) || !isEmpty(deleteGroups);
         return !isChosenGroup && (pristine || submitting);
     }
killedBy: setDisabledSaveButtonSemester function Edge cases for setDisabledSaveButtonSemester kills isEmpty semester_groups removal mutant
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BooleanLiteral
src/helper/disableComponent.js:21:73
         const newGroups = restGroups.filter((group) => !beginGroups.includes(group));
         const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
         const isChosenGroup =
-            isEmpty(semester.semester_groups) || !isEmpty(newGroups) || !isEmpty(deleteGroups);
+            isEmpty(semester.semester_groups) || !isEmpty(newGroups) || isEmpty(deleteGroups);
         return !isChosenGroup && (pristine || submitting);
     }
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester has groups and selectedGroups matches
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/helper/disableComponent.js:22:16
         const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
         const isChosenGroup =
             isEmpty(semester.semester_groups) || !isEmpty(newGroups) || !isEmpty(deleteGroups);
-        return !isChosenGroup && (pristine || submitting);
+        return false;
     }
     return pristine || submitting;
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester has groups and selectedGroups matches
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] LogicalOperator
src/helper/disableComponent.js:22:16
         const deleteGroups = beginGroups.filter((group) => !restGroups.includes(group));
         const isChosenGroup =
             isEmpty(semester.semester_groups) || !isEmpty(newGroups) || !isEmpty(deleteGroups);
-        return !isChosenGroup && (pristine || submitting);
+        return !isChosenGroup || pristine || submitting;
     }
     return pristine || submitting;
killedBy: setDisabledSaveButtonSemester function pristine and submitting equal false should return false if selectedGroups matches semester_groups exactly
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
src/helper/disableComponent.js:24:12
             isEmpty(semester.semester_groups) || !isEmpty(newGroups) || !isEmpty(deleteGroups);
         return !isChosenGroup && (pristine || submitting);
     }
-    return pristine || submitting;
+    return false;
 };
 
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester is empty
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] LogicalOperator
src/helper/disableComponent.js:24:12
             isEmpty(semester.semester_groups) || !isEmpty(newGroups) || !isEmpty(deleteGroups);
         return !isChosenGroup && (pristine || submitting);
     }
-    return pristine || submitting;
+    return pristine && submitting;
 };
 
killedBy: setDisabledSaveButtonSemester function pristine or submitting equal true should return true if semester is empty
statusReason: Error: expect(received).toBeTruthy()

Received: false
