[Killed] BlockStatement
src/helper/cardObjectHandler.js:1:65
-export const cardObjectHandler = (card = {}, semester, link) => {
-    return {
-        id: Number(card.lessonCardId ?? 0),
-        hours: Number(card.hours ?? 0),
-        subject: {
-            id: Number(card.subject?.id ?? 0),
-        },
-        lessonType: card.type,
-        subjectForSite: card.subjectForSite,
-        teacher: card.teacher,
-        linkToMeeting: link,
-        groups: card.groups ?? [],
-        grouped: card.grouped,
-        semester,
-    };
-};
+export const cardObjectHandler = (card = {}, semester, link) => {};
 
killedBy: cardObjectHandler function should return correct values
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] LogicalOperator
src/helper/cardObjectHandler.js:3:20
 export const cardObjectHandler = (card = {}, semester, link) => {
     return {
-        id: Number(card.lessonCardId ?? 0),
+        id: Number(card.lessonCardId && 0),
         hours: Number(card.hours ?? 0),
         subject: {
killedBy: cardObjectHandler function should return correct values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,11 +5,11 @@
        "id": 12,
        "title": "123",

[Killed] LogicalOperator
src/helper/cardObjectHandler.js:4:23
 export const cardObjectHandler = (card = {}, semester, link) => {
     return {
         id: Number(card.lessonCardId ?? 0),
-        hours: Number(card.hours ?? 0),
+        hours: Number(card.hours && 0),
         subject: {
             id: Number(card.subject?.id ?? 0),
killedBy: cardObjectHandler function should return correct values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -4,11 +4,11 @@
      Object {
        "id": 12,

[Killed] ObjectLiteral
src/helper/cardObjectHandler.js:5:18
     return {
         id: Number(card.lessonCardId ?? 0),
         hours: Number(card.hours ?? 0),
-        subject: {
-            id: Number(card.subject?.id ?? 0),
-        },
+        subject: {},
         lessonType: card.type,
         subjectForSite: card.subjectForSite,
killedBy: cardObjectHandler function should return correct values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

@@ -11,13 +11,11 @@
    "lessonType": "lecture",
    "linkToMeeting": "http://youtube.com",

[Killed] OptionalChaining
src/helper/cardObjectHandler.js:6:24
         id: Number(card.lessonCardId ?? 0),
         hours: Number(card.hours ?? 0),
         subject: {
-            id: Number(card.subject?.id ?? 0),
+            id: Number(card.subject.id ?? 0),
         },
         lessonType: card.type,
killedBy: cardObjectHandler function should handle empty card object without throwing
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
src/helper/cardObjectHandler.js:6:24
         id: Number(card.lessonCardId ?? 0),
         hours: Number(card.hours ?? 0),
         subject: {
-            id: Number(card.subject?.id ?? 0),
+            id: Number(card.subject?.id && 0),
         },
         lessonType: card.type,
killedBy: cardObjectHandler function should return correct values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -12,11 +12,11 @@
    "linkToMeeting": "http://youtube.com",
    "semester": Object {

[Killed] LogicalOperator
src/helper/cardObjectHandler.js:12:17
         subjectForSite: card.subjectForSite,
         teacher: card.teacher,
         linkToMeeting: link,
-        groups: card.groups ?? [],
+        groups: card.groups && [],
         grouped: card.grouped,
         semester,
killedBy: cardObjectHandler function should return correct values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

@@ -1,13 +1,8 @@
  Object {
    "grouped": true,
