[Killed] BlockStatement
src/helper/handleFormSubmit.js:1:66
-export const handleFormSubmit = (values, addItem, updateItem) => {
-    if (values.id) {
-        return updateItem;
-    }
-    return addItem;
-};
+export const handleFormSubmit = (values, addItem, updateItem) => {};
 
killedBy: handleFormSubmit function should return updateItem if values have a truthy id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "test"}
Received: undefined

[Killed] BlockStatement
src/helper/handleFormSubmit.js:2:20
 export const handleFormSubmit = (values, addItem, updateItem) => {
-    if (values.id) {
-        return updateItem;
-    }
+    if (values.id) {}
     return addItem;
 };
killedBy: handleFormSubmit function should return updateItem if values have a truthy id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "name": "test",
- }

[Killed] ConditionalExpression
src/helper/handleFormSubmit.js:2:9
 export const handleFormSubmit = (values, addItem, updateItem) => {
-    if (values.id) {
+    if (false) {
         return updateItem;
     }
killedBy: handleFormSubmit function should return updateItem if values have a truthy id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "name": "test",
- }
